---
kind: type
id: T:Autodesk.Revit.DB.JunctionType
source: html/4819d609-4c56-5077-2193-f0953a3ac445.htm
---
# Autodesk.Revit.DB.JunctionType

An enumerated type listing all the junction types for MEP curve types.

## Syntax (C#)
```csharp
public enum JunctionType
```